---
kind: method
id: M:Autodesk.Revit.DB.InSessionPrintSetting.Dispose
source: html/c144a71a-9a4f-952c-87e5-2908219ac905.htm
---
# Autodesk.Revit.DB.InSessionPrintSetting.Dispose Method

Releases all resources used by the InSessionPrintSetting

## Syntax (C#)
```csharp
public void Dispose()
```